## Practica 07: Análisis de Datos caso Salario de Especialistas en Inteligencia Artificial y Machine Learning

Practica 06: Análisis de Datos caso Salario de Especialistas en Inteligencia Artificial y Machine Learning

Asignatura: Extracción de Conocimientos de Base de Datos


PE: Ingeniería en Desarrollo  y Gestión de Software - 9°B

In [28]:
# Carga de paquetes y librerías a utilizar
# Básicos (Standard)
import numpy as np # Sirve para poder realizar procesamientos básicos numéricos en datos cuantitativos
import pandas as pd # Sirve para realizar los procesos ETL en un conjunto de datos
import time # Sirve para la manipulación de datos en diferentes formatos de tiempo
import requests # Sirve para realizar peticiones HTTP a APIs
import json # Sirve para manipular datos en formato JSON

!pip install pymysql
# Base de Datos
import sqlalchemy # Sirve para crear conexiones más robustas a bases de datos
from sqlalchemy import create_engine, text
import pymysql # Sirve para conectar con MySQL


# Graficadores (Plots)
import matplotlib.pyplot as plt
import plotly.express as px
import seaborn as sns

Requirement already satisfied: pymysql in c:\users\pc-19\anaconda3\lib\site-packages (1.1.1)

# Carga de Datos

# EJERCICIO 1: IMPORTACIÓN DE DATOS SQL (MySQL)

In [35]:
# Conectar a MySQL
engine = create_engine('mysql+pymysql://root:1234@localhost:3307/employees_ai_db', echo=True)

In [36]:
# Importar datos desde la base de datos SQL
query = """
SELECT * FROM employees_ai
"""

df = pd.read_sql(query, engine)
df.head()

2025-06-26 14:56:49,614 INFO sqlalchemy.engine.Engine SELECT DATABASE()
2025-06-26 14:56:49,615 INFO sqlalchemy.engine.Engine [raw sql] {}
2025-06-26 14:56:49,617 INFO sqlalchemy.engine.Engine SELECT @@sql_mode
2025-06-26 14:56:49,618 INFO sqlalchemy.engine.Engine [raw sql] {}
2025-06-26 14:56:49,620 INFO sqlalchemy.engine.Engine SELECT @@lower_case_table_names
2025-06-26 14:56:49,621 INFO sqlalchemy.engine.Engine [raw sql] {}
2025-06-26 14:56:49,624 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2025-06-26 14:56:49,625 INFO sqlalchemy.engine.Engine DESCRIBE `employees_ai_db`.`
SELECT * FROM employees_ai
`
2025-06-26 14:56:49,626 INFO sqlalchemy.engine.Engine [raw sql] {}
2025-06-26 14:56:49,627 INFO sqlalchemy.engine.Engine
SELECT * FROM employees_ai

2025-06-26 14:56:49,627 INFO sqlalchemy.engine.Engine [raw sql] {}
2025-06-26 14:56:49,631 INFO sqlalchemy.engine.Engine ROLLBACK

,employee_id,name,position,salary,experience_years,department
0,1,Ana García,Data Scientist,95000.0,3.0,Research
1,2,Carlos López,ML Engineer,105000.0,5.0,Engineering
2,3,María Rodríguez,AI Researcher,120000.0,8.0,Research
3,4,Juan Pérez,Data Analyst,75000.0,2.0,Analytics
4,5,Laura Martín,ML Engineer,100000.0,4.0,Engineering

In [37]:
### Limpiar de Datos
# Verificar información del dataset
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   employee_id       12 non-null     int64
 1   name              11 non-null     object
 2   position          11 non-null     object
 3   salary            11 non-null     float64
 4   experience_years  11 non-null     float64
 5   department        11 non-null     object
dtypes: float64(2), int64(1), object(3)
memory usage: 708.0+ bytes

In [38]:
# Verificar valores nulos
df.isnull().sum()

employee_id         0
name                1
position            1
salary              1
experience_years    1
department          1
dtype: int64

In [39]:
# Verificar duplicados
df.duplicated().sum()

0

In [40]:
# Eliminar duplicados
df_duplicados_eliminados = df.drop_duplicates()
df_duplicados_eliminados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   employee_id       12 non-null     int64
 1   name              11 non-null     object
 2   position          11 non-null     object
 3   salary            11 non-null     float64
 4   experience_years  11 non-null     float64
 5   department        11 non-null     object
dtypes: float64(2), int64(1), object(3)
memory usage: 708.0+ bytes

In [41]:
# Eliminar filas vacías o nulas
df_vacios_eliminados = df_duplicados_eliminados.dropna()
df_vacios_eliminados.info()

<class 'pandas.core.frame.DataFrame'>
Index: 11 entries, 0 to 11
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   employee_id       11 non-null     int64
 1   name              11 non-null     object
 2   position          11 non-null     object
 3   salary            11 non-null     float64
 4   experience_years  11 non-null     float64
 5   department        11 non-null     object
dtypes: float64(2), int64(1), object(3)
memory usage: 616.0+ bytes

# Transformación de Datos

In [42]:
# Crear nuevas columnas transformadas
df_vacios_eliminados = df[df['salary'].notna()].copy()

# Crear nuevas columnas transformadas sin advertencias
df_vacios_eliminados['salary_category'] = pd.cut(
    df_vacios_eliminados['salary'], 
    bins=[0, 80000, 100000, float('inf')], 
    labels=['Bajo', 'Medio', 'Alto']
)

df_vacios_eliminados['salary_per_experience'] = (
    df_vacios_eliminados['salary'] / df_vacios_eliminados['experience_years']
)

# Mostrar las primeras filas
df_vacios_eliminados.head()

,employee_id,name,position,salary,experience_years,department,salary_category,salary_per_experience
0,1,Ana García,Data Scientist,95000.0,3.0,Research,Medio,31666.666667
1,2,Carlos López,ML Engineer,105000.0,5.0,Engineering,Alto,21000.000000
2,3,María Rodríguez,AI Researcher,120000.0,8.0,Research,Alto,15000.000000
3,4,Juan Pérez,Data Analyst,75000.0,2.0,Analytics,Bajo,37500.000000
4,5,Laura Martín,ML Engineer,100000.0,4.0,Engineering,Medio,25000.000000

# Exportar Datos a una Tabla Temporal de SQL (MySQL)

In [43]:
# Exportar a tabla temporal en MySQL
table_name = 'employees_processed_temp'
df_vacios_eliminados.to_sql(table_name, engine, if_exists='replace', index=False)

2025-06-26 14:57:13,059 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2025-06-26 14:57:13,066 INFO sqlalchemy.engine.Engine DESCRIBE `employees_ai_db`.`employees_processed_temp`
2025-06-26 14:57:13,068 INFO sqlalchemy.engine.Engine [raw sql] {}
2025-06-26 14:57:13,075 INFO sqlalchemy.engine.Engine
CREATE TABLE employees_processed_temp (
	employee_id BIGINT,
	name TEXT,
	position TEXT,
	salary FLOAT(53),
	experience_years FLOAT(53),
	department TEXT,
	salary_category TEXT,
	salary_per_experience FLOAT(53)
)


2025-06-26 14:57:13,077 INFO sqlalchemy.engine.Engine [no key 0.00130s] {}
2025-06-26 14:57:13,094 INFO sqlalchemy.engine.Engine INSERT INTO employees_processed_temp (employee_id, name, position, salary, experience_years, department, salary_category, salary_per_experience) VALUES (%(employee_id)s, %(name)s, %(position)s, %(salary)s, %(experience_years)s, %(department)s, %(salary_category)s, %(salary_per_experience)s)
2025-06-26 14:57:13,094 INFO sqlalchemy.engine.Engine [generated in 0.00104s] [{'employee_id': 1, 'name': 'Ana García', 'position': 'Data Scientist', 'salary': 95000.0, 'experience_years': 3.0, 'department': 'Research', 'salary_category': 'Medio', 'salary_per_experience': 31666.666666666668}, {'employee_id': 2, 'name': 'Carlos López', 'position': 'ML Engineer', 'salary': 105000.0, 'experience_years': 5.0, 'department': 'Engineering', 'salary_category': 'Alto', 'salary_per_experience': 21000.0}, {'employee_id': 3, 'name': 'María Rodríguez', 'position': 'AI Researcher', 'salary': 120000.0, 'experience_years': 8.0, 'department': 'Research', 'salary_category': 'Alto', 'salary_per_experience': 15000.0}, {'employee_id': 4, 'name': 'Juan Pérez', 'position': 'Data Analyst', 'salary': 75000.0, 'experience_years': 2.0, 'department': 'Analytics', 'salary_category': 'Bajo', 'salary_per_experience': 37500.0}, {'employee_id': 5, 'name': 'Laura Martín', 'position': 'ML Engineer', 'salary': 100000.0, 'experience_years': 4.0, 'department': 'Engineering', 'salary_category': 'Medio', 'salary_per_experience': 25000.0}, {'employee_id': 6, 'name': 'Diego Silva', 'position': 'Data Scientist', 'salary': 98000.0, 'experience_years': 3.0, 'department': 'Research', 'salary_category': 'Medio', 'salary_per_experience': 32666.666666666668}, {'employee_id': 7, 'name': 'Carmen Ruiz', 'position': 'AI Engineer', 'salary': 110000.0, 'experience_years': 6.0, 'department': 'Engineering', 'salary_category': 'Alto', 'salary_per_experience': 18333.333333333332}, {'employee_id': 8, 'name': 'Roberto Torres', 'position': 'Data Analyst', 'salary': 72000.0, 'experience_years': 1.0, 'department': 'Analytics', 'salary_category': 'Bajo', 'salary_per_experience': 72000.0}  ... displaying 10 of 11 total bound parameter sets ...  {'employee_id': 10, 'name': 'Miguel Santos', 'position': 'AI Specialist', 'salary': 90000.0, 'experience_years': 2.0, 'department': 'Engineering', 'salary_category': 'Medio', 'salary_per_experience': 45000.0}, {'employee_id': 12, 'name': 'Miguel Santos', 'position': 'AI Specialist', 'salary': 90000.0, 'experience_years': 2.0, 'department': 'Engineering', 'salary_category': 'Medio', 'salary_per_experience': 45000.0}]
2025-06-26 14:57:13,097 INFO sqlalchemy.engine.Engine COMMIT

11

In [44]:
# Verificar que la tabla temporal se creó correctamente
verification_query = f"SELECT COUNT(*) as total_records FROM {table_name}"
result = pd.read_sql(verification_query, engine)

2025-06-26 14:57:17,044 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2025-06-26 14:57:17,046 INFO sqlalchemy.engine.Engine DESCRIBE `employees_ai_db`.`SELECT COUNT(*) as total_records FROM employees_processed_temp`
2025-06-26 14:57:17,048 INFO sqlalchemy.engine.Engine [raw sql] {}
2025-06-26 14:57:17,051 INFO sqlalchemy.engine.Engine SELECT COUNT(*) as total_records FROM employees_processed_temp
2025-06-26 14:57:17,053 INFO sqlalchemy.engine.Engine [raw sql] {}
2025-06-26 14:57:17,062 INFO sqlalchemy.engine.Engine ROLLBACK

In [45]:
# Verificar exportación
verification_query = f"SELECT COUNT(*) as total FROM {table_name}"
result = pd.read_sql(verification_query, engine)
result

2025-06-26 14:57:19,420 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2025-06-26 14:57:19,421 INFO sqlalchemy.engine.Engine DESCRIBE `employees_ai_db`.`SELECT COUNT(*) as total FROM employees_processed_temp`
2025-06-26 14:57:19,423 INFO sqlalchemy.engine.Engine [raw sql] {}
2025-06-26 14:57:19,426 INFO sqlalchemy.engine.Engine SELECT COUNT(*) as total FROM employees_processed_temp
2025-06-26 14:57:19,427 INFO sqlalchemy.engine.Engine [raw sql] {}
2025-06-26 14:57:19,431 INFO sqlalchemy.engine.Engine ROLLBACK

   total
0     11

# Ejercicio 2

# Importar datos de un API - get

In [48]:
# Realizar petición GET a una API
api_url = "https://jsonplaceholder.typicode.com/users"
response = requests.get(api_url)

In [52]:
api_data = response.json()
df_api = pd.json_normalize(api_data)

df_api.head()

,id,name,username,email,phone,website,address.street,address.suite,address.city,address.zipcode,address.geo.lat,address.geo.lng,company.name,company.catchPhrase,company.bs
0,1,Leanne Graham,Bret,Sincere@april.biz,1-770-736-8031 x56442,hildegard.org,Kulas Light,Apt. 556,Gwenborough,92998-3874,-37.3159,81.1496,Romaguera-Crona,Multi-layered client-server neural-net,harness real-time e-markets
1,2,Ervin Howell,Antonette,Shanna@melissa.tv,010-692-6593 x09125,anastasia.net,Victor Plains,Suite 879,Wisokyburgh,90566-7771,-43.9509,-34.4618,Deckow-Crist,Proactive didactic contingency,synergize scalable supply-chains
2,3,Clementine Bauch,Samantha,Nathan@yesenia.net,1-463-123-4447,ramiro.info,Douglas Extension,Suite 847,McKenziehaven,59590-4157,-68.6102,-47.0653,Romaguera-Jacobson,Face to face bifurcated interface,e-enable strategic applications
3,4,Patricia Lebsack,Karianne,Julianne.OConner@kory.org,493-170-9623 x156,kale.biz,Hoeger Mall,Apt. 692,South Elvis,53919-4257,29.4572,-164.2990,Robel-Corkery,Multi-tiered zero tolerance productivity,transition cutting-edge web services
4,5,Chelsey Dietrich,Kamren,Lucio_Hettinger@annie.ca,(254)954-1289,demarco.info,Skiles Walks,Suite 351,Roscoeview,33263,-31.8129,62.5342,Keebler LLC,User-centric fault-tolerant solution,revolutionize end-to-end systems

# Limpiar Datos

In [53]:
# Verificar información del dataset de API
df_api.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 15 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   id                   10 non-null     int64
 1   name                 10 non-null     object
 2   username             10 non-null     object
 3   email                10 non-null     object
 4   phone                10 non-null     object
 5   website              10 non-null     object
 6   address.street       10 non-null     object
 7   address.suite        10 non-null     object
 8   address.city         10 non-null     object
 9   address.zipcode      10 non-null     object
 10  address.geo.lat      10 non-null     object
 11  address.geo.lng      10 non-null     object
 12  company.name         10 non-null     object
 13  company.catchPhrase  10 non-null     object
 14  company.bs           10 non-null     object
dtypes: int64(1), object(14)
memory usage: 1.3+ KB

In [54]:
# Verificar valores nulos
df_api.isnull().sum()

id                     0
name                   0
username               0
email                  0
phone                  0
website                0
address.street         0
address.suite          0
address.city           0
address.zipcode        0
address.geo.lat        0
address.geo.lng        0
company.name           0
company.catchPhrase    0
company.bs             0
dtype: int64

In [55]:
# Eliminar duplicados del API
df_api_clean = df_api.drop_duplicates()

In [56]:
# Eliminar valores nulos
df_api_clean = df_api_clean.dropna()

df_api_clean.shape

(10, 15)

# Transformación de Datos

In [57]:
# Aplicar transformaciones a los datos del API
df_api_clean['phone_format'] = df_api_clean['phone'].apply(
    lambda x: 'US_Format' if x.startswith('1-') or x.startswith('(') 
    else 'International' if x.startswith('0') 
    else 'Other'
)

df_api_clean['user_category'] = pd.cut(df_api_clean['id'], 
                                      bins=[0, 3, 7, float('inf')], 
                                      labels=['Nuevo', 'Intermedio', 'Avanzado'])

df_api_clean['first_name'] = df_api_clean['name'].str.split().str[0]
df_api_clean['last_name'] = df_api_clean['name'].str.split().str[-1]

df_api_clean.head()

,id,name,username,email,phone,website,address.street,address.suite,address.city,address.zipcode,address.geo.lat,address.geo.lng,company.name,company.catchPhrase,company.bs,phone_format,user_category,first_name,last_name
0,1,Leanne Graham,Bret,Sincere@april.biz,1-770-736-8031 x56442,hildegard.org,Kulas Light,Apt. 556,Gwenborough,92998-3874,-37.3159,81.1496,Romaguera-Crona,Multi-layered client-server neural-net,harness real-time e-markets,US_Format,Nuevo,Leanne,Graham
1,2,Ervin Howell,Antonette,Shanna@melissa.tv,010-692-6593 x09125,anastasia.net,Victor Plains,Suite 879,Wisokyburgh,90566-7771,-43.9509,-34.4618,Deckow-Crist,Proactive didactic contingency,synergize scalable supply-chains,International,Nuevo,Ervin,Howell
2,3,Clementine Bauch,Samantha,Nathan@yesenia.net,1-463-123-4447,ramiro.info,Douglas Extension,Suite 847,McKenziehaven,59590-4157,-68.6102,-47.0653,Romaguera-Jacobson,Face to face bifurcated interface,e-enable strategic applications,US_Format,Nuevo,Clementine,Bauch
3,4,Patricia Lebsack,Karianne,Julianne.OConner@kory.org,493-170-9623 x156,kale.biz,Hoeger Mall,Apt. 692,South Elvis,53919-4257,29.4572,-164.2990,Robel-Corkery,Multi-tiered zero tolerance productivity,transition cutting-edge web services,Other,Intermedio,Patricia,Lebsack
4,5,Chelsey Dietrich,Kamren,Lucio_Hettinger@annie.ca,(254)954-1289,demarco.info,Skiles Walks,Suite 351,Roscoeview,33263,-31.8129,62.5342,Keebler LLC,User-centric fault-tolerant solution,revolutionize end-to-end systems,US_Format,Intermedio,Chelsey,Dietrich

# Exportar datos

In [58]:
# Exportar datos del API procesados
df_api_clean.to_csv('api_data_processed.csv', index=False)

# Exportar a base de datos
df_api_clean.to_sql('api_data_processed', engine, if_exists='replace', index=False)

2025-06-26 14:58:56,034 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2025-06-26 14:58:56,038 INFO sqlalchemy.engine.Engine DESCRIBE `employees_ai_db`.`api_data_processed`
2025-06-26 14:58:56,040 INFO sqlalchemy.engine.Engine [raw sql] {}
2025-06-26 14:58:56,044 INFO sqlalchemy.engine.Engine
CREATE TABLE api_data_processed (
	id BIGINT,
	name TEXT,
	username TEXT,
	email TEXT,
	phone TEXT,
	website TEXT,
	`address.street` TEXT,
	`address.suite` TEXT,
	`address.city` TEXT,
	`address.zipcode` TEXT,
	`address.geo.lat` TEXT,
	`address.geo.lng` TEXT,
	`company.name` TEXT,
	`company.catchPhrase` TEXT,
	`company.bs` TEXT,
	phone_format TEXT,
	user_category TEXT,
	first_name TEXT,
	last_name TEXT
)


2025-06-26 14:58:56,045 INFO sqlalchemy.engine.Engine [no key 0.00091s] {}
2025-06-26 14:58:56,064 INFO sqlalchemy.engine.Engine INSERT INTO api_data_processed (id, name, username, email, phone, website, `address.street`, `address.suite`, `address.city`, `address.zipcode`, `address.geo.lat`, `address.geo.lng`, `company.name`, `company.catchPhrase`, `company.bs`, phone_format, user_category, first_name, last_name) VALUES (%(id)s, %(name)s, %(username)s, %(email)s, %(phone)s, %(website)s, %(address_street)s, %(address_suite)s, %(address_city)s, %(address_zipcode)s, %(address_geo_lat)s, %(address_geo_lng)s, %(company_name)s, %(company_catchPhrase)s, %(company_bs)s, %(phone_format)s, %(user_category)s, %(first_name)s, %(last_name)s)
2025-06-26 14:58:56,065 INFO sqlalchemy.engine.Engine [generated in 0.00110s] [{'id': 1, 'name': 'Leanne Graham', 'username': 'Bret', 'email': 'Sincere@april.biz', 'phone': '1-770-736-8031 x56442', 'website': 'hildegard.org', 'address_street': 'Kulas Light', 'address_suite': 'Apt. 556', 'address_city': 'Gwenborough', 'address_zipcode': '92998-3874', 'address_geo_lat': '-37.3159', 'address_geo_lng': '81.1496', 'company_name': 'Romaguera-Crona', 'company_catchPhrase': 'Multi-layered client-server neural-net', 'company_bs': 'harness real-time e-markets', 'phone_format': 'US_Format', 'user_category': 'Nuevo', 'first_name': 'Leanne', 'last_name': 'Graham'}, {'id': 2, 'name': 'Ervin Howell', 'username': 'Antonette', 'email': 'Shanna@melissa.tv', 'phone': '010-692-6593 x09125', 'website': 'anastasia.net', 'address_street': 'Victor Plains', 'address_suite': 'Suite 879', 'address_city': 'Wisokyburgh', 'address_zipcode': '90566-7771', 'address_geo_lat': '-43.9509', 'address_geo_lng': '-34.4618', 'company_name': 'Deckow-Crist', 'company_catchPhrase': 'Proactive didactic contingency', 'company_bs': 'synergize scalable supply-chains', 'phone_format': 'International', 'user_category': 'Nuevo', 'first_name': 'Ervin', 'last_name': 'Howell'}, {'id': 3, 'name': 'Clementine Bauch', 'username': 'Samantha', 'email': 'Nathan@yesenia.net', 'phone': '1-463-123-4447', 'website': 'ramiro.info', 'address_street': 'Douglas Extension', 'address_suite': 'Suite 847', 'address_city': 'McKenziehaven', 'address_zipcode': '59590-4157', 'address_geo_lat': '-68.6102', 'address_geo_lng': '-47.0653', 'company_name': 'Romaguera-Jacobson', 'company_catchPhrase': 'Face to face bifurcated interface', 'company_bs': 'e-enable strategic applications', 'phone_format': 'US_Format', 'user_category': 'Nuevo', 'first_name': 'Clementine', 'last_name': 'Bauch'}, {'id': 4, 'name': 'Patricia Lebsack', 'username': 'Karianne', 'email': 'Julianne.OConner@kory.org', 'phone': '493-170-9623 x156', 'website': 'kale.biz', 'address_street': 'Hoeger Mall', 'address_suite': 'Apt. 692', 'address_city': 'South Elvis', 'address_zipcode': '53919-4257', 'address_geo_lat': '29.4572', 'address_geo_lng': '-164.2990', 'company_name': 'Robel-Corkery', 'company_catchPhrase': 'Multi-tiered zero tolerance productivity', 'company_bs': 'transition cutting-edge web services', 'phone_format': 'Other', 'user_category': 'Intermedio', 'first_name': 'Patricia', 'last_name': 'Lebsack'}, {'id': 5, 'name': 'Chelsey Dietrich', 'username': 'Kamren', 'email': 'Lucio_Hettinger@annie.ca', 'phone': '(254)954-1289', 'website': 'demarco.info', 'address_street': 'Skiles Walks', 'address_suite': 'Suite 351', 'address_city': 'Roscoeview', 'address_zipcode': '33263', 'address_geo_lat': '-31.8129', 'address_geo_lng': '62.5342', 'company_name': 'Keebler LLC', 'company_catchPhrase': 'User-centric fault-tolerant solution', 'company_bs': 'revolutionize end-to-end systems', 'phone_format': 'US_Format', 'user_category': 'Intermedio', 'first_name': 'Chelsey', 'last_name': 'Dietrich'}, {'id': 6, 'name': 'Mrs. Dennis Schulist', 'username': 'Leopoldo_Corkery', 'email': 'Karley_Dach@jasper.info', 'phone': '1-477-935-8478 x6430', 'website': 'ola.org', 'address_street': 'Norberto Crossing', 'address_suite': 'Apt. 950', 'address_city': 'South Christy', 'address_zipcode': '23505-1337', 'address_geo_lat': '-71.4197', 'address_geo_lng': '71.7478', 'company_name': 'Considine-Lockman', 'company_catchPhrase': 'Synchronised bottom-line interface', 'company_bs': 'e-enable innovative applications', 'phone_format': 'US_Format', 'user_category': 'Intermedio', 'first_name': 'Mrs.', 'last_name': 'Schulist'}, {'id': 7, 'name': 'Kurtis Weissnat', 'username': 'Elwyn.Skiles', 'email': 'Telly.Hoeger@billy.biz', 'phone': '210.067.6132', 'website': 'elvis.io', 'address_street': 'Rex Trail', 'address_suite': 'Suite 280', 'address_city': 'Howemouth', 'address_zipcode': '58804-1099', 'address_geo_lat': '24.8918', 'address_geo_lng': '21.8984', 'company_name': 'Johns Group', 'company_catchPhrase': 'Configurable multimedia task-force', 'company_bs': 'generate enterprise e-tailers', 'phone_format': 'Other', 'user_category': 'Intermedio', 'first_name': 'Kurtis', 'last_name': 'Weissnat'}, {'id': 8, 'name': 'Nicholas Runolfsdottir V', 'username': 'Maxime_Nienow', 'email': 'Sherwood@rosamond.me', 'phone': '586.493.6943 x140', 'website': 'jacynthe.com', 'address_street': 'Ellsworth Summit', 'address_suite': 'Suite 729', 'address_city': 'Aliyaview', 'address_zipcode': '45169', 'address_geo_lat': '-14.3990', 'address_geo_lng': '-120.7677', 'company_name': 'Abernathy Group', 'company_catchPhrase': 'Implemented secondary concept', 'company_bs': 'e-enable extensible e-tailers', 'phone_format': 'Other', 'user_category': 'Avanzado', 'first_name': 'Nicholas', 'last_name': 'V'}, {'id': 9, 'name': 'Glenna Reichert', 'username': 'Delphine', 'email': 'Chaim_McDermott@dana.io', 'phone': '(775)976-6794 x41206', 'website': 'conrad.com', 'address_street': 'Dayna Park', 'address_suite': 'Suite 449', 'address_city': 'Bartholomebury', 'address_zipcode': '76495-3109', 'address_geo_lat': '24.6463', 'address_geo_lng': '-168.8889', 'company_name': 'Yost and Sons', 'company_catchPhrase': 'Switchable contextually-based project', 'company_bs': 'aggregate real-time technologies', 'phone_format': 'US_Format', 'user_category': 'Avanzado', 'first_name': 'Glenna', 'last_name': 'Reichert'}, {'id': 10, 'name': 'Clementina DuBuque', 'username': 'Moriah.Stanton', 'email': 'Rey.Padberg@karina.biz', 'phone': '024-648-3804', 'website': 'ambrose.net', 'address_street': 'Kattie Turnpike', 'address_suite': 'Suite 198', 'address_city': 'Lebsackbury', 'address_zipcode': '31428-2261', 'address_geo_lat': '-38.2386', 'address_geo_lng': '57.2232', 'company_name': 'Hoeger LLC', 'company_catchPhrase': 'Centralized empowering task-force', 'company_bs': 'target end-to-end models', 'phone_format': 'International', 'user_category': 'Avanzado', 'first_name': 'Clementina', 'last_name': 'DuBuque'}]
2025-06-26 14:58:56,069 INFO sqlalchemy.engine.Engine COMMIT

10